Revit 2027 API
BuiltInFailures.DividedSurfaceFailures.DividedSurfaceSplitManagerProblemClosedArcOrEllipse Property
 Divided Surface cannot be split by a closed arc or ellipse.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DividedSurfaceSplitManagerProblemClosedArcOrEllipse { get; }
Public Shared ReadOnly Property DividedSurfaceSplitManagerProblemClosedArcOrEllipse As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DividedSurfaceSplitManagerProblemClosedArcOrEllipse {
	FailureDefinitionId^ get ();
}
static member DividedSurfaceSplitManagerProblemClosedArcOrEllipse : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DividedSurfaceFailures Class
Autodesk.Revit.DB Namespace